"""
      通过文件操作将bill.txt中的正式和测试两种类型中的测试筛出只留下正式类型
      要创建bill.txt文件 再将bill.txt中的文件复制到bill.txt文件中
"""
fr =open("D:/bill.txt","r",encoding = 'utf-8') # 打开文件读取已存在的文件
fw =open("D:/bill_bak.txt","w",encoding="utf-8")# 打开文件准备写入
for line in fr:  # for循环遍历阅读文件
    line = line.strip() # 去除每一行的开头结尾换行符
    if line.split(",")[4] == "测试": # 这一行以","为分割符分割成列表，其中第四个列表等于测试时则跳过
        continue
    fw.write(line) # 将这行写入到bill_bak.txt文件中
    fw.write("\n")# 再写入换行符
fr.close() #关闭文件fr
fw.close() # 关闭文件fw
fr1 = open("D:/bill_bak.txt","r",encoding = 'utf-8') #打开文件fr1
print(fr1.read()) #将fr1读取到的内容输出出来
"""
bill.txt文件中的内容: 
name,date,money,type,remarks
周杰轮,2022-01-01,100000,消费,正式
周杰轮,2022-01-02,300000,收入,正式 
周杰轮,2022-01-03,100000,消费,测试
 林俊节,2022-01-01,300000,收入,正式 
林俊节,2022-01-02,100000,消费,测试 
林俊节,2022-01-03,100000,消费,正式 
林俊节,2022-01-04,100000,消费,测试 
林俊节,2022-01-05,500000,收入,正式 
张学油,2022-01-01,100000,消费,正式
 张学油,2022-01-02,500000,收入,正式
 张学油,2022-01-03,900000,收入,测试 
王力鸿,2022-01-01,500000,消费,正式 
王力鸿,2022-01-02,300000,消费,测试 
王力鸿,2022-01-03,950000,收入,正式
 刘德滑,2022-01-01,300000,消费,测试 
刘德滑,2022-01-02,100000,消费,正式 
刘德滑,2022-01-03,300000,消费,正式
"""
